{
    "Post 1": {
        "Title": "Success and Disappointment Megathread for the Week of (May 11)",
        "Flair": "Weekly Megathread",
        "Date Created": "05-11-2020 12:14:44",
        "Upvotes": 4,
        "Upvote Ratio": 0.84,
        "ID": "ghjjg5",
        "Edited?": "False",
        "Is Locked?": false,
        "NSFW?": false,
        "Is Spoiler?": false,
        "Stickied?": true,
        "URL": "https://www.reddit.com/r/jobs/comments/ghjjg5/success_and_disappointment_megathread_for_the/",
        "Comment Count": 11,
        "Text": "This is the weekly success and disappointment Megathread for the week of May 11.  Please post all of your successes and disappointments for this week, including job offers and other victories, as well as any venting of frustration, in this thread, and this thread only.  Thanks!"
    },
    "Post 2": {
        "Title": "How to get over guilt of leaving? Feel obligated to stay",
        "Flair": "Leaving a job",
        "Date Created": "05-10-2020 16:30:17",
        "Upvotes": 231,
        "Upvote Ratio": 0.95,
        "ID": "gh0nnj",
        "Edited?": "False",
        "Is Locked?": false,
        "NSFW?": false,
        "Is Spoiler?": false,
        "Stickied?": true,
        "URL": "https://www.reddit.com/r/jobs/comments/gh0nnj/how_to_get_over_guilt_of_leaving_feel_obligated/",
        "Comment Count": 70,
        "Text": "Hey,\n\nI’m 100% certain I want to leave my job for a variety of reasons, even if it means I’ll be out of employment for a few months. Reasons include my diminishing mental health at work, my depleted lack of motivation/ambition working there, and a burning desire to go and work in a field more relevant to my career goals.\n\nI can’t however bring myself to just do it. I’ve been working there for several years, and even began a new role there after going through this exact same guilt process just 6 months ago. I accepted a new role there after handing in my notice as they wanted me to stay. I remember very quietly thinking at the time “this is a mistake, why are you doing this”. \n\nWhile I’ve had some successes and have sometimes felt fulfilled in the role, it’s only in the past couple of weeks that I’ve realised that I can’t continue and this is not sustainable. I feel overall lost in this role, unproductive, and I don’t have the capacity or willpower to try and make it work any longer. I want out, beyond a doubt.\n\nThis time, my guilt is compounded by the fact that I accepted this new role, like I’ve made some sort of blood pact. I keep trying to remind myself that it’s just an employment contract and it’s not a life commitment, but am really struggling. \n\nHow can I overcome this? Even the thought of handing in my notice now gives me enormous waves of dread, anxiety, and guilt even though I know it’s what is best for me right now. I also fear getting a “non-reference” (e.g. just dates employed, or outright refusal to provide a reference) as I’ve worked there so long I’ve hardly anyone else to rely on. I anticipate a certain level of resentment for handing in notice again, and fear this will influence references. This may just be a part of the anxiety I’m feeling though.\n\nAny advice, or anyone been through something similar?"
    },
    "Post 3": {
        "Title": "How do I skip office for one or several interviews during a week for a new job when my current employer allows 30 minute or even a full day leave for only true emergencies?",
        "Flair": "Interviews",
        "Date Created": "05-12-2020 16:07:02",
        "Upvotes": 98,
        "Upvote Ratio": 0.95,
        "ID": "gi9yrh",
        "Edited?": "05-12-2020 11:22:30",
        "Is Locked?": false,
        "NSFW?": false,
        "Is Spoiler?": false,
        "Stickied?": false,
        "URL": "https://www.reddit.com/r/jobs/comments/gi9yrh/how_do_i_skip_office_for_one_or_several/",
        "Comment Count": 33,
        "Text": "Hi there. \n\nI live in Bangladesh and I am looking for a new job. I currently work at a retail bank as a universal banker from 9:30am till 7:30pm to 8:00pm or even 9:00pm. Due to commute, I leave home at 7:30am and reach home at 10:00pm. They only provide a 15 minute lunch break. The work is very multitasking and stressful and high paced. There is huge sales and customer service pressure. \n\nThe environment is extremely restrictive and controlling. You are not allowed to go outside for even a smoke break without verbal permission. For going out for any purpose you need to apply in a computer and be granted leave by two managers on the computer. Such leave is allowed only for customer visits and you need to tell them where you are going and they will later call to confirm if you did go there. They don't allow these for personal reasons except say if you have a visa application (doctor's appointments cannot be made during office hours) or a medical emergency and the reasons has to be included in the online application. \n\nEven if you are visiting a customer for work, the work is such that you cannot leave when you want to. Customers are always poring in, and it takes a minimum of 30 minutes (I have counted) or sometimes more or never to leave depending upon situation. \n\nYou also absolutely cannot obviously tell your employer that you are going out for another interview since they consider it a lack of loyalty. \n\nAlso here in Bangladesh, they usually have 3 or 4 rounds of interviews for each job. These are all scheduled during the work day and cannot be scheduled later. First is a selection, then a test, then a upper management board and finally a CEO. At least that was what I faced in my current and first job right out of MBA. \n\nIn such a case: \n\n* How do I manage to attend the job interviews if I cannot go out once I am at office?\n\n* What happens when I get 2-3 calls from employers in a week? I can maybe not go to work for 1 day citing some medical issues, but skipping 2-3 days is not an option at all.\n\nEDIT: Companies here do not reschedule interviews or offer a videoconferencing one. I asked for a rescheduling with 3 companies and none obliged so I missed out on those opportunities."
    },
    "Post 4": {
        "Title": "I was laid off due to COVID-19 on March 20th. Was told my position was eliminated. Today, I just found out that my previous job was listed online a week ago as “open” and is accepting applications.",
        "Flair": "Covid-19",
        "Date Created": "05-11-2020 17:54:33",
        "Upvotes": 672,
        "Upvote Ratio": 0.98,
        "ID": "ghny75",
        "Edited?": "False",
        "Is Locked?": true,
        "NSFW?": false,
        "Is Spoiler?": false,
        "Stickied?": false,
        "URL": "https://www.reddit.com/r/jobs/comments/ghny75/i_was_laid_off_due_to_covid19_on_march_20th_was/",
        "Comment Count": 97,
        "Text": "What is the best approach here?\n\nPrevious employer hasn’t reached out to notify me the position is open.\n\nIt’s listed on 5 different employment websites, so definitely not a mistake posting.\n\nAlso a very specific job with a specific title. So I know it was my previous job."
    },
    "Post 5": {
        "Title": "Had a message from my boss that I should 'keep my options open'!",
        "Flair": "Covid-19",
        "Date Created": "05-12-2020 17:55:55",
        "Upvotes": 4,
        "Upvote Ratio": 1.0,
        "ID": "gibocy",
        "Edited?": "False",
        "Is Locked?": false,
        "NSFW?": false,
        "Is Spoiler?": false,
        "Stickied?": false,
        "URL": "https://www.reddit.com/r/jobs/comments/gibocy/had_a_message_from_my_boss_that_i_should_keep_my/",
        "Comment Count": 8,
        "Text": "My boss messaged me earlier and I am worried that I am going to be without a job soon! I've only joined the company since the beginning of the year and I really like working there.\n\nThis is the message he sent.\n\n\"Morning - Sorry that HR haven't been in contact with you since the shutdown. You can appreciate that business has and is suffering as a result of the restrictions brought about by COVID virus. I understand from the owners of the business that cuts will he made and between you and me I would keep my options open. We are not back at work yet so by all means keep me posted of any further news. All the best.\"\n\nWhat do you lot make of this? Should I be worried?"
    },
    "Post 6": {
        "Title": "How do I find a job in the current situation (from being currently unemployed)?",
        "Flair": "Unemployment",
        "Date Created": "05-12-2020 16:35:06",
        "Upvotes": 3,
        "Upvote Ratio": 1.0,
        "ID": "giadm5",
        "Edited?": "False",
        "Is Locked?": false,
        "NSFW?": false,
        "Is Spoiler?": false,
        "Stickied?": false,
        "URL": "https://www.reddit.com/r/jobs/comments/giadm5/how_do_i_find_a_job_in_the_current_situation_from/",
        "Comment Count": 6,
        "Text": "I was made redundant from my last job in the UK in March (administrative job).\n\nCurrently unemployed and have savings up until December.\n\nHow are things looking in terms of me finding a job? I have a business degree (first class) and some experience in transactional finance.\n\nDo you think I will be able to find a job until October-November? I am registered with a lot of recruiters, but almost no e-mails/calls or interviews lined up since covid hit.\n\nCan you provide some advice as I am quite worried and stressed.\n\nThanks."
    },
    "Post 7": {
        "Title": "Jobs for hard of hearing/deaf people?",
        "Flair": "Job searching",
        "Date Created": "05-12-2020 18:41:54",
        "Upvotes": 2,
        "Upvote Ratio": 1.0,
        "ID": "gichdz",
        "Edited?": "False",
        "Is Locked?": false,
        "NSFW?": false,
        "Is Spoiler?": false,
        "Stickied?": false,
        "URL": "https://www.reddit.com/r/jobs/comments/gichdz/jobs_for_hard_of_hearingdeaf_people/",
        "Comment Count": 1,
        "Text": "Hey everyone, I've got moderate to severe hearing loss and currently work in one of the trades (Welding, Pipe fitting) but I'm really struggling with communication and background noise which badly affects my work and gives me anxiety that I'm putting myself and others at risk of an accident. It's also starting to effect me outside of work and in my normal life where I'm just constantly tired from trying to hear people and filter out background noise, I just don't feel like myself.\n\nI want to find something more suitable for me, I don't really have the best grades or qualifications so it makes it a bit harder, I just need something where communication is very little and just a job where I can do my own thing. I'm in my early 20s and live in the UK.\n\nThank you!"
    },
    "Post 8": {
        "Title": "Is it ok to connect to the recruiter on LinkedIn?",
        "Flair": "Recruiters",
        "Date Created": "05-12-2020 16:18:59",
        "Upvotes": 3,
        "Upvote Ratio": 1.0,
        "ID": "gia52w",
        "Edited?": "False",
        "Is Locked?": false,
        "NSFW?": false,
        "Is Spoiler?": false,
        "Stickied?": false,
        "URL": "https://www.reddit.com/r/jobs/comments/gia52w/is_it_ok_to_connect_to_the_recruiter_on_linkedin/",
        "Comment Count": 2,
        "Text": "Hello!!!\n\nHope all is well with you in this uncertain times.\n\n**Context:**\n\nI received an e-mail on last Friday (8 May) by a recruiter from the retail fashion division of a big company in my country.\n\nThey have several business areas, and I applied to opportunities in the food retail division (supply chain and logistics), and by that contact, the recruiter from the other fashion division said in the email that wanted to call me soon, to know my interests and motivations, if it made sense.\n\nAs soon as I read the email (end of the day in friday 2hours later), I sent a response thanking for the contact and showing availability to talk about that, and if preferable for them, i was available to arrange a given time to expect a call!\n\nI didnt receive till now a response from the recruiter and at this point I don't know what to do. I searched the recruiter profile in LinkedIn and found it, it has the premium version so later the person will know I visited him.\n\n**My doubt is**: is it too wrong in this phase to connect with the person? I found other 2 recruiters from the same division, one with the same function and other with another...\n\nI would like to expand my network since i have <100 connections (most of them with recruiters only), and because its a dream/perfect company to work that I thought I would never get a shot at working with them.\n\nIf I shouldn't connect directly with this recruiter that contacted me, then can I connect with the others? Does this makes sense?\n\nI'm desperate to get a job so I can start working and take off my career, it has been a long journey of 1.5 years looking for a job (while I work in part-times) that meets my profile and wishes for a future career in management related to supply chain **or** sales&marketing.\n\nI know when we are a young graduate you shouldn't narrow too much your options, but I felt confident that would eventually find an opportunity in this fields in the retail sector...\n\n&#x200B;\n\nThanks for any input and recommendations you may give! Have a great day!"
    },
    "Post 9": {
        "Title": "How do I quit a contract job I just started?",
        "Flair": "Leaving a job",
        "Date Created": "05-12-2020 17:49:12",
        "Upvotes": 2,
        "Upvote Ratio": 1.0,
        "ID": "gibkef",
        "Edited?": "05-12-2020 09:58:45",
        "Is Locked?": false,
        "NSFW?": false,
        "Is Spoiler?": false,
        "Stickied?": false,
        "URL": "https://www.reddit.com/r/jobs/comments/gibkef/how_do_i_quit_a_contract_job_i_just_started/",
        "Comment Count": 2,
        "Text": "Hi, \nI started a contract role when I really had no more job leads.My first week I had a final round with a full-time position and mid week they gave me an offer. \n\n\nI negotiated, signed and accepted the offer with the start date 2 weeks from now. \n\n\nI really like my manager but I obviously expect her to be upset with me leaving. \nI was planning to tell them due to personal circumstances I am leaving this role though I really liked the work and her management.\n\nEdit: Should I tell them I found another job?\n\nAny suggestions on how to quit?"
    },
    "Post 10": {
        "Title": "Should I follow up after the interviewer said that they would call and hasn’t?",
        "Flair": "Post-interview",
        "Date Created": "05-12-2020 15:33:27",
        "Upvotes": 5,
        "Upvote Ratio": 0.73,
        "ID": "gi9ht6",
        "Edited?": "05-12-2020 09:03:39",
        "Is Locked?": false,
        "NSFW?": false,
        "Is Spoiler?": false,
        "Stickied?": false,
        "URL": "https://www.reddit.com/r/jobs/comments/gi9ht6/should_i_follow_up_after_the_interviewer_said/",
        "Comment Count": 4,
        "Text": "I had an interview for a position at a local animal hospital last week on Wednesday, which I felt went reasonably well. They had me shadow an assistant and the veterinarian for a little over two hours. We talked salary, how my schedule would (potentially) work, etc. \n\nThe interviewer said that they would call on Friday or Monday. Today is Tuesday and no call. I want to follow up, but I do not want to overwhelm or harass them. Needless to say, I’m desperate for this job but don’t want to seem so.  Any reassurance or advice is really appreciated.\n\nUpdate: Thank you all for the advice. I gave them a quick call and I was informed that the head veterinarian chose to hire someone who’d came in two days after me. I am disappointed, but they suggested that they would be hiring again in about a month and would keep me in mind."
    }
}